app/Controllers/Home.php

    public function index()
    {
        $clientesModel = new ClientesModel();
        $cursosModel = new CursosModel();

        // Obtener todos los clientes
        $clientes = $clientesModel->findAll();

        // Obtener los cursos asociados a cada cliente
        foreach ($clientes as &$cliente) {
            $cliente['cursos'] = $cursosModel->where('cliente_id', $cliente['id'])->findAll();
---
SELECT *
FROM "clientes"
SELECT *
FROM "cursos"
WHERE "cliente_id" = '1'